package com.example.sontaya16.karya;

public class Questions {

    public String MQuestions[] = {
            "เศษอาหาร ควรจะทิ้งลงถังขยะสีอะไร", "Reuse คืออะไร","Recycle คืออะไร","วัสดุในข้อใดที่ไม่สามารถนำไปรีไซเคิลได้", "ขยะเปียก หมายถึงอะไร",
            "ขยะแห้ง หมายถึงอะไร","ข้อใดไม่จัดอยู่ในประเภท\"ขยะอันตราย\" ","ขยะที่พบปริมาณมากที่สุด คือ","ข้อใดเป็นขยะประเภท ขยะทั่วไป", "ข้อใดเป็นขยะประเภท ขยะรีไซเคิลทั้งหมด",
            "การกำจัดขยะทั่วไป ควรมีวิธีการกำจัดอย่างไร","ขยะประเภทย่อยสลายได้ สามารถนำไปใช้ประโยชน์ได้อย่างไร", "เหตุใดจึงควรคัดแยกขยะก่อนทิ้ง", "ขยะประเภทใดที่มีประโยชน์มากที่สุด", "หากเราทุกคนช่วยกันคัดแยกขยะ จะก่อให้เกิดสิ่งใด"
    };
    public String MChoice [][] = {
            {"เเดง","เขียว","น้ำเงิน","เหลือง"},
            {"การเปลี่ยนขยะให้กลายเป็นวัตถุที่นำมาใช้ได้อีก","การนำกลับมาใช้ใหม่","ลดระดับการใช้สิ่งของที่ก่อให้เกิดขยะ","นำสิ่งของมาใช้ซ้ำ"},
            {"การเปลี่ยนขยะให้กลายเป็นวัตถุที่นำมาใช้ได้อีก","การนำกลับมาใช้ใหม่","ลดระดับการใช้สิ่งของที่ก่อให้เกิดขยะ","นำสิ่งของมาใช้ซ้ำ"},
            {"ขวดแก้ว","กระจกเงา","กระดาษ","กระป๋องอลูมิเนียม"},
            {"ขยะที่ย่อยสลายได้ง่าย","ขยะที่ย่อยสลายได้ยาก","ขยะที่มีสารเคมีปนเปื้อน","ขยะที่ตกน้ำ"},
            {"ขยะที่ย่อยสลายได้ง่าย","ขยะที่ย่อยสลายได้ยาก","ขยะที่มีสารเคมีปนเปื้อน","ขยะที่ตากเเดด"},
            {"ถ่านไฟฉาย","หลอดไฟ","เศษแก้ว","เศษเหล็ก"},
            {"ขยะย่อยสลายไ้ด้","ขยะพิษ","ขยะรีไซเคิล","ขยะทั่วไป"},
            {"ขวดพลาสติก","หลอดไฟ","เศษอาหาร","ถุงพลาสติก"},
            {"ขวดแก้ว,กระดาษ,เศษอาหาร","กระป๋องอลูมิเนียม,ขวดน้ำพลาสติก,เศษเหล็ก","ถุงพลาสติก,ถ่านไฟฉาย,เปลือกส้ม","กระป๋องสเปรย์,ใบตอง,โฟม"},
            {"ฝังกลบ","เผา","นำไปรีไซเคิล","ถูกทุกข้อ"},
            {"นำกลับมาใช้ใหม่ได้","นำไปทำสิ่งประดิษฐ์ใหม่ๆ","หมักทำเป็นปุ๋ยชีวภาพ","ถูกทุกข้อ"},
            {"เพื่อความสะดวกของเจ้าหน้าที่ในการกำจัดขยะ", "เพื่อสร้างรายได้เสริมจากขายขยะ", "เพื่อนำขยะกลับมาใช้ใหม่ได้ทั้งหมด" ,"เพื่อกำจัดขยะอย่างถูกวิธีและใช้ประโยชน์จากขยะบางประเภทได้"},
            {"ขยะมูลฝอย", "ขยะย่อยสลายได้", "ขยะรีไซเคิล", "ขยะพิษ"},
            {"ปริมาณขยะลดลง", "ช่วยลดมลภาวะ", "ลดภาวะโลกร้อน", "ถูกทุกข้อ"}
    };

    private String MAnswer[] = {
            "เขียว","นำสิ่งของมาใช้ซ้ำ","การนำกลับมาใช้ใหม่","กระดาษ","ขยะที่ย่อยสลายได้ง่าย","ขยะที่ย่อยสลายได้ยาก","เศษแก้ว","ขยะทั่วไป","ถุงพลาสติก","กระป๋องอลูมิเนียม,ขวดน้ำพลาสติก,เศษเหล็ก"
            ,"เผา","หมักทำเป็นปุ๋ยชีวภาพ", "เพื่อกำจัดขยะอย่างถูกวิธีและใช้ประโยชน์จากขยะบางประเภทได้", "ขยะรีไซเคิล", "ถูกทุกข้อ"
    };

    public String getQuestion (int a){
        String question = MQuestions[a];
        return question;
    }

    public String getChoice1(int a){
        String choice = MChoice[a][0];
        return choice;
    }
    public String getChoice2(int a){
        String choice = MChoice[a][1];
        return choice;
    }
    public String getChoice3(int a){
        String choice = MChoice[a][2];
        return choice;
    }
    public String getChoice4(int a){
        String choice = MChoice[a][3];
        return choice;
    }

    public String getCorrectAnswer (int a){
        String answer = MAnswer[a];
        return answer;

    }
}
